app/Controllers/Fungsi.php

function logPublic($status, $error)
{
        $logs = new ModelLogs();

        $data = [
                'ip_address' => $_SERVER['REMOTE_ADDR'],
                'uri' => $_SERVER['REQUEST_URI'],
                'user' => 'public',
                'method' => $_SERVER['REQUEST_METHOD'],
                'code' => $error,
                // 0 error system,1 Success 2 failed
                'status' => $status
        ];
        $logs->insert($data);
---
INSERT INTO `logs` (`ip_address`, `uri`, `user`, `method`, `code`, `status`) VALUES ('::1', '/auth', 'public', 'POST', 1, '::1 logout')

        public function auth()
        {
                try {
                        $session = session();
                        $model = new ModelUsers();
                        $lihat = $model->where('user_name', $_POST['username'])->first();
                        if ($lihat != null) {

                                if ($lihat['has_login'] == 'true') {
                                        $dataoff = [
                                                'has_login' => 'false',
                                                'last_logged_out' => date("Y-m-d H:i:s"),
                                        ];
                                        $model->update($session->get('id'), $dataoff);
---
SELECT *
FROM `users`
WHERE `user_name` = 'superadmin'
 LIMIT 1
UPDATE `users` SET `has_login` = 'false', `last_logged_out` = '2023-03-13 11:21:04'