app/Controllers/Page.php

SELECT *
FROM `settings`
WHERE `setting_variable` = 'logo'
---
function settingValues($cari)
{
    $model = new ModelSetting();
    return $model->where('setting_variable', $cari)->findall()[0]['setting_value'];

SELECT *
FROM `categories`
ORDER BY `id` DESC
SELECT *
FROM `tags`
ORDER BY `id` DESC
SELECT *
FROM `organization`
JOIN `employees` ON `organization`.`person` = `employees`.`id`
WHERE `name` = 'kabid'
ORDER BY `id` DESC
---
function sessions($page)
{
    $session = session();
    if ($session->get('name') == null) {
        return null;
    } else {
        $data['id'] = $session->get('id');
        $data['name'] = $session->get('name');
        $data['type'] = $session->get('type');
        $data['page'] = $page;
        $modelmcategory = new ModelMCategory();
        $data['mcategories'] = $modelmcategory->orderBy('id', 'DESC')->findAll();
        $modelmtag = new ModelMTags();
        $data['mtags'] = $modelmtag->orderBy('id', 'DESC')->findAll();
        $data['setting_logo'] = settingValues('logo');
        $data['setting_title'] = settingValues('title');
        $modelStaff = new ModelOrganization();
        $data['atasan'] = $modelStaff->join('employees', 'organization.person = employees.id')->where('name', 'kabid')->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `questions`
WHERE `type` = 'pesan'
ORDER BY `id` DESC
SELECT *
FROM `users`
ORDER BY `id` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'slider'
ORDER BY `id` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'post'
ORDER BY `id` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'info'
ORDER BY `id` DESC
---
    public function index()
    {
        try {
            $data = sessions('Dashboard');
            if ($data == null) {
                out();
                return redirect()->to('/login');
            } else {
                $model1 = new ModelEmploye();
                $model2 = new ModelModuls();
                $model3 = new ModelUsers();
                $model4 = new ModelPosts();
                $model = new ModelQuestion();
                $data['pesanQty'] = count($model->where('type', 'pesan')->orderBy('id', 'DESC')->findAll());
                $data['staffQty'] = count($model1->findAll());
                $data['appQty'] = count($model2->orderBy('id', 'DESC')->findAll());
                $data['userQty'] = count($model3->orderBy('id', 'DESC')->findAll());
                $data['sliderQty'] = count($model4->where('post_type', 'slider')->orderBy('id', 'DESC')->findAll());
                $data['newsQty'] = count($model4->where('post_type', 'post')->orderBy('id', 'DESC')->findAll());
                $data['infoQty'] = count($model4->where('post_type', 'info')->orderBy('id', 'DESC')->findAll());