app/Controllers/Publics.php

SELECT *
FROM `menus`
SELECT *
FROM `posts`
WHERE `post_type` = 'info'
AND `post_status` = 'publish'
ORDER BY `created_at` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'info'
AND `post_status` = 'publish'
ORDER BY `created_at` ASC
SELECT *
FROM `posts`
WHERE `post_type` = 'post'
AND `post_status` = 'publish'
ORDER BY `created_at` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'slider'
ORDER BY `created_at` DESC
SELECT *
FROM `posts`
WHERE `post_type` = 'it'
AND `post_status` = 'publish'
ORDER BY `created_at` DESC
---
function main($page)
{
    $model1 = new ModelMenus();
    $model2 = new ModelPosts();

    $data['page'] = $page;
    $data['menus'] = $model1->findAll();

    $data['info'] = $model2->where('post_type', 'info')->where('post_status', 'publish')->orderBy('created_at', 'DESC')->findAll();
    $data['infonews'] = $model2->where('post_type', 'info')->where('post_status', 'publish')->orderBy('created_at', 'ASC')->findAll();
    $data['news'] = $model2->where('post_type', 'post')->where('post_status', 'publish')->orderBy('created_at', 'DESC')->findAll();
    $data['newsnews'] = $model2->where('post_type', 'post')->where('post_status', 'publish')->orderBy('created_at', 'DESC')->findAll();
    $data['slider'] = $model2->where('post_type', 'slider')->orderBy('created_at', 'DESC')->findAll();
    $data['pojokit'] = $model2->where('post_type', 'it')->where('post_status', 'publish')->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `produk`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data = main('Beranda');
        $model2 = new ModelModuls();

        $model4 = new ModelProduk();
        $model5 = new ModelStaff();
        $data['unit'] = $model2->findAll();
        $data['produk'] = $model4->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `organization`
JOIN `employees` ON `organization`.`person` = `employees`.`id`
SELECT *
FROM `organization`
WHERE `name` = 'kabid'
---
    public function profil()
    {
        $data = main('Profil');
        $data['tentang_instansi'] = settingValues('tentang_instansi');
        $data['pimpinan_name'] = settingValues('pimpinan_name');
        $data['pimpinan_foto'] = settingValues('pimpinan_foto');
        $data['pimpinan_nip'] = settingValues('pimpinan_nip');
        $data['pimpinan_jabatan'] = settingValues('pimpinan_jabatan');
        $data['kantor_foto'] = settingValues('kantor_foto');
        $data['tugas_pokok'] = settingValues('tugas_pokok');
        $data['tugas_fungsi'] = settingValues('tugas_fungsi');
        $data['n_width'] = settingValues('nodewidth');
        $data['c_width'] = settingValues('chartwidth');
        $data['c_height'] = settingValues('chartheight');
        $data['system'] = settingValues('type');
        $modal = new ModelEmploye();
        $modalOrganization = new ModelOrganization();
        $data['employe'] = $modal->findAll();
        $data['data'] = $modalOrganization->join('employees', 'organization.person = employees.id')->findAll();
        $data['ada'] = count($modalOrganization->where('name', 'kabid')->findAll());

SELECT *
FROM `produk`
WHERE `name` = 'Candi Bahal'
SELECT *
FROM `users`
WHERE `id` = '1'
SELECT *
FROM `menus`
WHERE `menu_title` = 'event'
---
    public function detailproduk($id)
    {
        $menu = new ModelMenus();
        $produk = new ModelProduk();
        if (count($produk->where('name', $id)->findAll()) != 0) {
            $data = main('Produk');
            $model = new ModelProduk();
            $modelUser = new ModelUsers();

            $new = ($model->where('name', $id)->findAll())[0];
            $data['harga'] = $new['price'];
            $author = $modelUser->where('id', $new['created_by'])->findAll();
            $data['created'] = date('d M Y H:i:s', strtotime($new['created_at']));
            $data['author'] = $author[0]['user_full_name'];
            $data['title'] = $new['name'];
            //     $data['tags'] = $new['post_tags'];
            $data['image'] = $new['image'];
            $data['content'] = $new['deskripsi'];
            return view('Public/DetailProduk', $data);
        } elseif (count($menu->where('menu_title', $id)->findAll()) == 0) {